### Data 가져오기

In [3]:
import pandas as pd
#url = 'https://tinyurl.com/titanic-csv'
url ='https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
### error_bad_lines 추가

In [5]:
dataframe = pd.read_csv(url, error_bad_lines=False)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### DataFrame 생성

In [6]:
import pandas as pd
dataframe = pd.DataFrame()

# 열을 추가.
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]
dataframe.head()

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

### 열 추가

In [7]:
# 열을 만듭니다.
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])
# 열을 추가합니다. - df.append
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

### Dataframe에 data 넣는법

In [8]:
############################## 1 : numpy 배열을 이용
import numpy as np
data = [ ['Jacky Jackson', 38, True], ['Steven Stevenson', 25, False] ]
matrix = np.array(data)
### columns 에 컬럼 이름 기재
pd.DataFrame(matrix, columns=['Name', 'Age', 'Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [16]:
############################## 2 : 원본 리스트 
pd.DataFrame(data, columns=['Name', 'Age', 'Driver'])

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [17]:
############################## 3 : 열 이름과 데이터를 매핑한 딕셔너리
data = {'Name': ['Jacky Jackson', 'Steven Stevenson'],
        'Age': [38, 25],
        'Driver': [True, False]}
pd.DataFrame(data)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [18]:
############################## 4 : 샘플마다 열, 값을 매핑한 딕셔너리
data = [ {'Name': 'Jacky Jackson', 'Age': 38, 'Driver': True},
         {'Name': 'Steven Stevenson', 'Age': 25, 'Driver': False} ]
pd.DataFrame(data, index=['row1', 'row2'])

                  Name  Age  Driver
row1     Jacky Jackson   38    True
row2  Steven Stevenson   25   False

In [9]:
import pandas as pd
#url = 'https://tinyurl.com/titanic-csv'
url ='https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
### error_bad_lines 추가 
dataframe = pd.read_csv(url, error_bad_lines=False)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [10]:
dataframe.shape

(1313, 6)

In [11]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

### Data탐색

In [12]:
import pandas as pd
############################## 1행 조회
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [13]:
############################## 행 slice 조회
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [14]:
dataframe.iloc[:2]

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### Index

In [15]:
############################ 인덱스를 설정합니다.
dataframe = dataframe.set_index(dataframe['Name'])

############################ 행을 확인합니다. - index를 기준으로 
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [16]:
### loc는 df의 인덱스가 레이블(문자?)일때 사용, iloc는 df의 위치를 참조 
# 'Allison, Miss Helen Loraine' 이전까지 Age 열과 Sex 열만 선택합니다.
dataframe.loc[:'Allison, Miss Helen Loraine', 'Age':'Sex']

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

In [17]:
# dataframe[:2]와 동일합니다.
dataframe[:'Allison, Miss Helen Loraine']

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [18]:
dataframe[['Age', 'Sex']].head(2)

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

### 조건 걸어서 선택하기

In [21]:
# 라이브러리를 임포트합니다.
import pandas as pd
#url = 'https://tinyurl.com/titanic-csv'
url ='https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
### error_bad_lines 추가 
dataframe = pd.read_csv(url, error_bad_lines=False)
dataframe.head(5)
print(dataframe.shape)

(1313, 6)

In [23]:
### 컬럼 조건 1개 걸기
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [24]:
### 컬럼 조건 여러개 걸기
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

### 값을 치환하기 - replace

In [25]:
dataframe['Sex'].replace("female", "Woman").head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [27]:
### 여러개 동시에 치환 replace ( ["이전컬럼", "이전컬럼2"], ["이후컬럼", "이후컬럼2"])
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [28]:
#### 값을 치환 
dataframe.replace(1, "One").head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29,female,One,One
1,"Allison, Miss Helen Loraine",1st,2,female,0,One
2,"Allison, Mr Hudson Joshua Creighton",1st,30,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25,female,0,One
4,"Allison, Master Hudson Trevor",1st,0.92,male,One,0

In [29]:
# replace는 정규 표현식도 인식 : 값을 치환하고 두 개의 행을 출력합니다.
# 문자열 일부만 치환하고 싶은 경우는 regex=True를 설정해 정규 표현식으로 문자열 치환을 원하는 부분만 할 수 있습니다.
dataframe.replace(r"1st", "First", regex=True).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

In [30]:
# 여러개의 컬럼을 한 값으로 변환
dataframe.replace(["female", "male"], "person").head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  person         1        1
1          Allison, Miss Helen Loraine    1st   2.0  person         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0  person         0        0

In [31]:
### Dictionary형태로,  female을 1로 바꾸고 male을 0으로 바꿉니다.
dataframe.replace({"female": 1, "male": 0}).head(3)

                                  Name PClass   Age  Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0    1         1        1
1          Allison, Miss Helen Loraine    1st   2.0    1         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    0         0        0

In [32]:
dataframe.replace(["female" , "male"] ,[1 , 0]).head(3)

                                  Name PClass   Age  Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0    1         1        1
1          Allison, Miss Helen Loraine    1st   2.0    1         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    0         0        0

### 컬럼 (열) 이름 변경하기

In [34]:
############## rename 이용하여 컬럼명 변경
# 열 이름을 바꾸고 두 개의 행을 출력합니다.
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [35]:
# Dictionary 매개변수에 바꾸려는 열을 동시에 가능 : 열 이름을 바꾸고 두 개의 행을 출력합니다.
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [38]:
dataframe.rename(columns ={'Name' : 'name', 'Age' :'age'}).head(1)

                           name PClass   age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

In [39]:
################## 전체 열의 이름을 동시에 바꾸려면 다음 코드 처럼 키는 이전 열 이름을 사용하고 값은 비어있는 딕셔너리를 만듬

# 라이브러리를 임포트합니다.
import collections

# 딕셔너리를 만듭니다.
column_names = collections.defaultdict(str)

# 키를 만듭니다.
for name in dataframe.columns:
    column_names[name]

# 딕셔너리를 출력합니다.
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [40]:
### index 매개변수를 사용하여 인덱스를 바꿈

# 인덱스 0을 -1로 바꿉니다.
dataframe.rename(index={0:-1}).head(2)

                            Name PClass   Age     Sex  Survived  SexCode
-1  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
 1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [42]:
dataframe.rename(index={0:-1, 1:0}).head(2)

                            Name PClass   Age     Sex  Survived  SexCode
-1  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
 0   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [41]:
############################################## 열 이름 전체를 소문자로 바꿉니다.
dataframe.rename(str.lower, axis='columns').head(2)

                           name pclass   age     sex  survived  sexcode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### 최솟값, 최댓값, 합, 평균 계산 및 Count !!! 통계값

In [48]:
# 통곗값을 계산합니다.
print('최댓값:', dataframe['Age'].max())
print('최솟값:', dataframe['Age'].min())
print('평균:', dataframe['Age'].mean())
print('합:', dataframe['Age'].sum())
print('카운트:', dataframe['Age'].count())

print('분산:', dataframe['Age'].var())
print('표준편차:', dataframe['Age'].std())
# 3이 기준 3 에 가까우면 정규분포에 가까움
print('첨도:', dataframe['Age'].kurt())
# 0이 기준 0보다 작으면 오른쪽에 치우쳐 있고, 양수일 경우 반대로 왼쪽에 치우쳐져 있음
print('비대칭도(왜도):', dataframe['Age'].skew())
print('평균의 표준오차(sem):', dataframe['Age'].sem())
# [0] 추가하여 값만 추출
print('최빈값:', dataframe['Age'].mode()[0])
#print('최빈값2:', dataframe.Age.value_counts()[0])
print('중간값:', dataframe['Age'].median())

최댓값: 71.0
최솟값: 0.17
평균: 30.397989417989415
합: 22980.88
카운트: 756
분산: 203.32047012439133
표준편차: 14.259048710359023
첨도: -0.036536168924722556
비대칭도(왜도): 0.36851087371648295
평균의 표준오차(sem): 0.5185965877244657
최빈값: 22.0
중간값: 28.0

In [49]:
# 공분산
dataframe.cov()

                 Age  Survived   SexCode
Age       203.320470 -0.430491 -0.382054
Survived   -0.430491  0.225437  0.114070
SexCode    -0.382054  0.114070  0.228230

In [51]:
# 상관계수
dataframe.corr()

               Age  Survived   SexCode
Age       1.000000 -0.061254 -0.055138
Survived -0.061254  1.000000  0.502891
SexCode  -0.055138  0.502891  1.000000

### 고유한 값 찾기

In [52]:
# 고유한 값을 찾습니다. --------------- unique()
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [53]:
# 카운트를 출력합니다.
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [54]:
# 카운트를 출력합니다.
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [55]:
# 고유한 값의 개수를 출력합니다. ----------- nunique()
dataframe['PClass'].nunique()

4

In [56]:
dataframe.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

In [57]:
# dropna : NaN을 값을 카운트 할지 안할지 여부, 기본 값은 True로서 제외 하고 Count 
dataframe.nunique(dropna =False)

Name        1310
PClass         4
Age           76
Sex            2
Survived       2
SexCode        2
dtype: int64

### Null Value 다루기

In [59]:
### Null 값 선택 --- isnull()

dataframe[dataframe['Age'].isnull()].head(3)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0

In [60]:
### Null 값 치환

dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: name 'NaN' is not defined

In [61]:
# 라이브러리를 임포트합니다.
import numpy as np

# NaN으로 값을 바꿉니다.
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [62]:
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,NaN,1,0

In [66]:
# 데이터를 적재하고 누락된 값을 설정합니다.
# na_values = ['a', 'b', c] -> a,b,c 값들이 NaN으로 변경  
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])
dataframe.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [68]:
dataframe[12:14]

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [69]:
### 판다스는 기본적으로 ' ', 'N/A' ,'null' 등을 NaN으로 인식하게 되는데, keep default na 를 False 로 설정하면 NaN으로 인식하지않음

dataframe = pd.read_csv(url, na_values=['female'], keep_default_na=False)
dataframe[12:14]
### female 만 NaN으로 인식

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [71]:
### na_filter False 로 설정하면 NaN 변환을 하지 않음
dataframe = pd.read_csv(url)
dataframe[12:14]

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [72]:
dataframe = pd.read_csv(url, na_filter=False)
dataframe[12:14]

                            Name PClass Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st      female         1        1
13      Barkworth, Mr Algernon H    1st        male         1        0

![nn](pd_read_csv_option.JPG)

### 컬럼 (열) 삭제 - Drop

In [73]:
# 데이터를 적재합니다.
dataframe = pd.read_csv(url)
# 열을 삭제합니다. ---- drop('', axis = 1)
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [74]:
# 열을 삭제합니다.
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [75]:
# PClass 열을 삭제합니다. - 열의 위치 기준, 1개 위치만됨
dataframe.drop(dataframe.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [76]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### 행 삭제

In [78]:
# 데이터를 적재합니다.
dataframe = pd.read_csv(url)
# 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe[dataframe['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [79]:
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [80]:
### index 사용 삭제 
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

### 중복된 행 삭제 - drop_duppicates()

In [83]:
# 데이터를 적재합니다.
dataframe = pd.read_csv(url)
# 중복 행을 삭제하고 처음 두 개의 행을 출력합니다.
dataframe.drop_duplicates().shape
# 모든 행이 고유한 것을 확인

(1313, 6)

In [86]:
### 일부 조건에서 중복된 행 삭제

# 중복된 행을 삭제합니다.
dataframe.drop_duplicates(subset=['Age','Sex']).shape
### 기본적으로 drop_duplicates 는 첫번째 것을 유지하고 나머지 삭제 하는데, keep option 을 이용하여 조정 가능
### duplcated 는 중복여부를 불리언 시리즈로 반환

(135, 6)

In [87]:
dataframe.drop_duplicates(subset=['Age','Sex'], keep = 'last').shape

(135, 6)

In [91]:
dataframe.duplicated(subset =['Age', 'Sex']).head(4)

0    False
1    False
2    False
3    False
dtype: bool

### Grouping - Group by

In [92]:
# 데이터를 적재합니다.
dataframe = pd.read_csv(url)
# ‘Sex’ 열의 값으로 행을 그룹핑하고 평균을 계산합니다.
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [94]:
dataframe.groupby('Sex')['Name'].count()

Sex
female    462
male      851
Name: Name, dtype: int64

In [95]:
# 행을 그룹핑한 다음 평균을 계산합니다.
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

### 시간 간격에 따라 행 그룹핑

In [96]:
# 라이브러리를 임포트합니다.
import pandas as pd
import numpy as np

# 날짜 범위를 만듭니다. - data_range 만들기 data_range(시작점, 끝점, default = 'D') ex. 3D 3일 간격
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
print(time_index)

DatetimeIndex(['2017-06-06 00:00:00', '2017-06-06 00:00:30',
               '2017-06-06 00:01:00', '2017-06-06 00:01:30',
               '2017-06-06 00:02:00', '2017-06-06 00:02:30',
               '2017-06-06 00:03:00', '2017-06-06 00:03:30',
               '2017-06-06 00:04:00', '2017-06-06 00:04:30',
               ...
               '2017-07-10 17:15:00', '2017-07-10 17:15:30',
               '2017-07-10 17:16:00', '2017-07-10 17:16:30',
               '2017-07-10 17:17:00', '2017-07-10 17:17:30',
               '2017-07-10 17:18:00', '2017-07-10 17:18:30',
               '2017-07-10 17:19:00', '2017-07-10 17:19:30'],
              dtype='datetime64[ns]', length=100000, freq='30S')

In [98]:
# 데이터프레임을 만듭니다.
dataframe = pd.DataFrame(index=time_index)
print(dataframe.head(3))

Empty DataFrame
Columns: []
Index: [2017-06-06 00:00:00, 2017-06-06 00:00:30, 2017-06-06 00:01:00]

In [100]:
# 난수 값으로 열을 만듭니다.
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
print(dataframe.head(3))

                     Sale_Amount
2017-06-06 00:00:00            1
2017-06-06 00:00:30            6
2017-06-06 00:01:00            3

In [101]:
# 주 단위로 그룹핑하여 계산
################################# resample 이 datetime 형태(시계열 Data)의 인덱스를 사용하여 자동 계산
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86853
2017-06-18       101172
2017-06-25       100836
2017-07-02       100441
2017-07-09       101077
2017-07-16        10450

In [104]:
dataframe.resample('3W').sum()

### 기본적으로 주, 월단위로 그룹핑했을 때 datetime 인덱스는 날짜로 표현되며 마지막 레이블을 기준으로 반환

            Sale_Amount
2017-06-11        86853
2017-07-02       302449
2017-07-23       111527

In [105]:
# 월 간격으로 그룹핑하고 행을 카운트합니다. label 을 이용하여 기준을 변경할 수 있음
dataframe.resample('3W', label='left').count()

            Sale_Amount
2017-05-21        17280
2017-06-11        60480
2017-07-02        22240

In [106]:
dataframe.resample('1H').sum().head(2)

                     Sale_Amount
2017-06-06 00:00:00          603
2017-06-06 01:00:00          582

In [107]:
### 월의 시작날짜로 부여하고 싶을때 'MS'
dataframe.resample('MS').count()

            Sale_Amount
2017-06-01        72000
2017-07-01        28000

###  resample() 메소드의 시간 단위 구간 설정
- 5분 단위 구간    : resample('5T')
- 10분 단위 구간  : resample('10T')
- 20분 단위 구간 : resample('20T')
- 1시간 단위 구간 : resample('1H')
- 1일 단위 구간    : resample('1D')
- 1주일 단위 구각 : resample('1W')
- 1달 단위 구간    : resample('1M')
- 1년 단위 구간    : resample('1Y')

### 열에 함수 적용하기

In [108]:
# 데이터를 적재합니다.
dataframe = pd.read_csv(url)

# 처음 두 이름을 대문자로 바꾸어 출력합니다.
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [109]:
# list comprehension 사용하여 변경
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

### apply

In [110]:
dataframe = pd.read_csv(url)

# 함수를 만듭니다.
def uppercase(x):
    return x.upper()

# apply 적용 : dataframe.apply(함수)
# 함수를 적용하고 두 개의 행을 출력합니다.
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

- apply와 map 의 차이는 map 메서드는 딕셔너리 입력으로 넣을 수 있고, apply 메서드는 매개변수를 지정

In [111]:
# Survived 열의 1을 Live로, 0을 Dead로 바꿉니다.
dataframe['Survived'].map({1:'Live', 0:'Dead'})[:5]

0    Live
1    Dead
2    Dead
3    Dead
4    Live
Name: Survived, dtype: object

In [112]:
# 함수의 매개변수(age)를 apply 메서드를 호출할 때 전달할 수 있습니다.
dataframe['Age'].apply(lambda x, age: x < age, age=30)[:5]

0     True
1     True
2    False
3     True
4     True
Name: Age, dtype: bool

In [113]:
# 각 열에서 가장 큰 값을 뽑습니다.
dataframe.apply(lambda x: max(x))

Name        del Carlo, Mrs Sebastiano (Argenia Genovese)
PClass                                               3rd
Age                                                   71
Sex                                                 male
Survived                                               1
SexCode                                                1
dtype: object

In [114]:
def truncate_string(x):
    if type(x) == str:
        return x[:20]
    return x

# 문자열의 길이를 최대 20자로 줄입니다.
# applymap : 
dataframe.applymap(truncate_string)[:5]

                   Name PClass    Age     Sex  Survived  SexCode
0  Allen, Miss Elisabet    1st  29.00  female         1        1
1  Allison, Miss Helen     1st   2.00  female         0        1
2  Allison, Mr Hudson J    1st  30.00    male         0        0
3  Allison, Mrs Hudson     1st  25.00  female         0        1
4  Allison, Master Huds    1st   0.92    male         1        0

### Group에 함수 적용

In [115]:
dataframe = pd.read_csv(url)

# 행을 그룹핑한 다음 함수를 적용합니다.
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

### Dataframe연결하기 (세로결합) - concat( [df1, df2], axis =0)

In [117]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터프레임을 만듭니다.
data_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

# 데이터프레임을 만듭니다.
data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

# 행 방향으로 데이터프레임을 연결합니다.
pd.concat([dataframe_a, dataframe_b], axis=0).head(5)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black

### Dataframe연결하기 (가로결합) - concat( [df1, df2], axis =1)

In [118]:
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [119]:
# df 생성, 행을 만듭니다.
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

# append : 행을 추가합니다.
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

### Merge on (inner join)

In [121]:
# 라이브러리를 임포트합니다.
import pandas as pd

# 데이터프레임을 만듭니다.
employee_data = {'employee_id': ['1', '2', '3', '4'],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id','name'])

# 데이터프레임을 만듭니다.
sales_data = {'employee_id': ['3', '4', '5', '6'],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

# 데이터프레임을 병합합니다.
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

### Merge how (outer join)

In [122]:
# outer join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [123]:
# left join
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [124]:
# 데이터프레임을 병합합니다.
# Join key 설정
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [125]:
# index key를 기준으로 조인
pd.merge(dataframe_employees, dataframe_sales, left_index= True, right_index =True)

  employee_id_x        name employee_id_y  total_sales
0             1   Amy Jones             3        23456
1             2  Allen Keys             4         2512
2             3  Alice Bees             5         2345
3             4  Tim Horton             6         1455